app/controllers/accounts_controller.rb

  def create
    @all_skills = Skill.find(:all)
    @user = User.new(params[:user])
    @account = Account.new(params[:account])
    if params[:account][:password].empty?
      flash[:notice] = 'Password is a required field'
    else
      hmac = HMAC::SHA1.new('1234')
      hmac.update(params[:account][:password])
      @account.password = hmac.to_s
    end
    @user.phone_number = @user.phone_number.strip
    if @user.phone_number != nil and !@user.phone_number.strip.empty?
      @user.phone_number = normalize_phone(@user.phone_number)
    end
    if params[:Admin] == '1'
      @account.admin = true
      @account.verified_skills = params[:skills]
    else
      @account.admin = false
      @account.skills = params[:skills]
      @sv = SkillVerification.new
      @sv.account = @account
      @sv.save!
---
INSERT INTO "accounts" ("account_name", "admin", "created_at", "email", "password", "skills", "updated_at", "users_id", "verified_skills") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)