app/controllers/problems_controller.rb

  def create
    @problem = Problem.new(:location => params[:problem][:location], :summary => params[:problem][:summary], :description => params[:problem][:description], :skills => params[:skills])

    @user = User.find_by_phone_number(params[:user][:phone_number])
---
SELECT "users".* FROM "users" WHERE "users"."phone_number" = 999 LIMIT 1

  def show
    id = params[:id]
    @problem = Problem.find(id)
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "1"]]